{"pages":[],"posts":[{"title":"Build your blog by using GitHub and Hexo","text":"IntroductionI had used Logdown as my Blog before, it’s a blog base on Markdown that’s why it’s popular for engineers. As the author is no longer maintained it, I’m look forward to find a new one to replace it, also based on Markdown. I think GitHub &amp; Hexo is a good solution for me. My environment is MAC Mojave 10.14.3.If you are also use MAC but the os version is not same, do not worry too much about it. The following steps are Install Node Install Hexo Create a new GitHub repository Initial your Hexo project Deploy to GitHub 1. Install NodeYou can install it on their official website directly. Node.js or If you have many projects and some of them are using different Node versions. I recommond you can use NVM. 2. Install Hexo1234567891011# Install Hexo Git$ npm install hexo-deployer-git --save# Install Hexo$ npm install hexo-cli -g# Install Hexo deployer git$ npm install hexo-deployer-git --save# Check Hexo versionhexo version 3. Create a new GitHub repositoryRepository name : yourname.github.io (change yourname to your GitHub Id) 4. Initial your Hexo project1234567891011# Initial blog $ hexo init blog# Change directory $ cd blog# Install node module $ npm install# Host on your local $ hexo serve You will see your Hexo project is running at http://localhost:4000 5. Deploy to GitHubGo to the _config.yml and find the deploy area.(change yourname to your GitHub Id) Blog/_config.yml12345deploy: type: git repository: https://github.com/yourname/yourname.github.io.git branch: master yourname: yourname 12# Deploy to GitHub$ hexo deploy -generate Then you can see your blog on the GitHub. ConclusionHexo is a great tool that you can build your own blog easily in a short time. And there are many powerful plug-ins. I changed the theme that you can find blow the reference or you can choose one you liked here. It looks better now! Reference Node.js管理神器nvm Hexo+GitHub，新手也可以快速建立部落格 hexo d命令报错 ERROR Deployer not found: git hexo-theme-icarus","link":"/2019/03/31/Build-your-blog-by-using-GitHub-and-Hexo/"},{"title":"How to reset a pushed commit to your remote git repository","text":"If you want to reset your lastest commit. 12$ git reset --hard HEAD~1$ git push --force Go to check your remote commit log, and make sure your reset already done.","link":"/2019/04/02/How-to-reset-a-pushed-commit-to-your-remote-git-repository/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2019/03/31/hello-world/"}],"tags":[],"categories":[]}